bench_results/run_20260721_032123.log
[INFO] Base URL: http://127.0.0.1:8080
[INFO] Lua script: scripts/wrk_mixed.lua
[INFO] CSV output: bench_results/summary_20260721_032123.csv
[INFO] Log output: bench_results/run_20260721_032123.log

[STEP] Warmup
[INFO] warmup: c=50 t=8 d=10s
Running 10s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   119.65ms   91.15ms 730.36ms   94.83%
    Req/Sec    58.50     15.07   101.00     74.16%
  Latency Distribution
     50%   99.27ms
     75%  118.09ms
     90%  143.85ms
     99%  665.40ms
  4484 requests in 10.09s, 677.46KB read
Requests/sec:    444.53
Transfer/sec:     67.16KB

[STEP] Staircase benchmark
[INFO] staircase: c=50 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    95.46ms   24.61ms 263.04ms   71.72%
    Req/Sec    62.79     14.99   120.00     71.46%
  Latency Distribution
     50%   92.12ms
     75%  108.92ms
     90%  126.90ms
     99%  170.20ms
  15090 requests in 30.12s, 2.23MB read
Requests/sec:    501.04
Transfer/sec:     75.75KB

[INFO] staircase: c=100 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   180.90ms   40.84ms 578.99ms   75.55%
    Req/Sec    66.29     21.85   173.00     68.80%
  Latency Distribution
     50%  179.15ms
     75%  202.56ms
     90%  225.34ms
     99%  305.05ms
  15890 requests in 30.10s, 2.35MB read
Requests/sec:    527.91
Transfer/sec:     79.96KB

[INFO] staircase: c=200 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   272.01ms   72.96ms 660.03ms   81.82%
    Req/Sec    93.83     38.07   250.00     72.72%
  Latency Distribution
     50%  250.25ms
     75%  284.56ms
     90%  388.50ms
     99%  529.05ms
  21992 requests in 30.10s, 3.25MB read
Requests/sec:    730.57
Transfer/sec:    110.61KB

[INFO] staircase: c=400 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   509.62ms  140.06ms   1.04s    69.70%
    Req/Sec   101.00     60.38   370.00     63.88%
  Latency Distribution
     50%  486.68ms
     75%  587.35ms
     90%  717.39ms
     99%  857.22ms
  23244 requests in 30.11s, 3.43MB read
Requests/sec:    771.88
Transfer/sec:    116.74KB

[INFO] staircase: c=800 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03s   221.73ms   1.67s    75.51%
    Req/Sec   117.36    114.98   696.00     85.53%
  Latency Distribution
     50%    1.04s 
     75%    1.14s 
     90%    1.28s 
     99%    1.57s 
  22630 requests in 30.10s, 3.34MB read
Requests/sec:    751.77
Transfer/sec:    113.66KB

[DONE] Benchmark finished.
[DONE] CSV: bench_results/summary_20260721_032123.csv
[DONE] LOG: bench_results/run_20260721_032123.log